app/controllers/movies_controller.rb

    def index
      @all_ratings = Movie.all_ratings


      if params[:ratings]
        @ratings_to_show = params[:ratings].keys
        @movies = Movie.where(rating: @ratings_to_show)
      else
        @ratings_to_show = Hash[@all_ratings.collect {|key| [key, '1']}]
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R')  ORDER BY release_date
SELECT "movies".* FROM "movies"  ORDER BY release_date